mise à jour diag classe final
